# MySQL

In [1]:
import pandas as pd

In [2]:
datos=pd.read_csv('../data/apple_store.csv')

datos.head()

,id,track_name,size_bytes,price,rating_count_tot,rating_count_ver,user_rating,user_rating_ver,prime_genre
0,281656475,PAC-MAN Premium,100788224,3.99,21292,26,4.0,4.5,Games
1,281796108,Evernote - stay organized,158578688,0.00,161065,26,4.0,3.5,Productivity
2,281940292,"WeatherBug - Local Weather, Radar, Maps, Alerts",100524032,0.00,188583,2822,3.5,4.5,Weather
3,282614216,"eBay: Best App to Buy, Sell, Save! Online Shop...",128512000,0.00,262241,649,4.0,4.5,Shopping
4,282935706,Bible,92774400,0.00,985920,5320,4.5,5.0,Reference

In [3]:
from sqlalchemy import create_engine

In [5]:
# lenguaje+driver://usuario:password@servidor:puerto/database
str_conn='mysql+pymysql://root:password@localhost:3306/Apps'

motor=create_engine(str_conn)

In [6]:
datos.to_sql(name='Ratings', con=motor, if_exists='append', index=False)

In [7]:
cnx=motor.raw_connection()

In [9]:
datos=pd.read_sql('select * from Ratings', motor)
datos.head()

,id,track_name,size_bytes,price,rating_count_tot,rating_count_ver,user_rating,user_rating_ver,prime_genre
0,281656475,PAC-MAN Premium,100788224,3.99,21292.0,26.0,4.0,4.5,Games
1,281796108,Evernote - stay organized,158578688,0.00,161065.0,26.0,4.0,3.5,Productivity
2,281940292,"WeatherBug - Local Weather, Radar, Maps, Alerts",100524032,0.00,188583.0,2822.0,3.5,4.5,Weather
3,282614216,"eBay: Best App to Buy, Sell, Save! Online Shop...",128512000,0.00,262241.0,649.0,4.0,4.5,Shopping
4,282935706,Bible,92774400,0.00,985920.0,5320.0,4.5,5.0,Reference

In [12]:
datos=pd.read_sql('''select track_name, 
                            price, rating_count_tot,
                            user_rating
                     from Ratings
                     where price=0 and user_rating>4;''', motor)
datos.head()

                            track_name  price  rating_count_tot  user_rating
0                                Bible    0.0          985920.0          4.5
1                     Sonos Controller    0.0           48905.0          4.5
2  OpenTable - Restaurant Reservations    0.0          113936.0          4.5
3                        Chase Mobile℠    0.0          233270.0          4.5
4               The Masters Tournament    0.0          148160.0          4.5

In [17]:
datos=pd.read_sql('''select prime_genre,
                            sum(rating_count_tot) as total_rating,
                            avg(user_rating) as avg_rating
                     from Ratings
                     where price=0
                     group by prime_genre
                     order by total_rating desc
                     limit 10;''', cnx)
datos.head()

         prime_genre  total_rating  avg_rating
0              Games    42713023.0    3.528578
1  Social Networking     7590182.0    2.996503
2      Photo & Video     4550732.0    3.793413
3              Music     3784296.0    3.940299
4      Entertainment     3614869.0    3.148204

In [18]:
str_conn='mysql+pymysql://root:password@localhost:3306/publications'

motor=create_engine(str_conn)

In [21]:
query='''
        select group_concat(t.title) as titles,
        t.year
        from (select title, year(max(pubdate)) as 'year',
        count(titleauthor.title_id) as num_titles,
        group_concat(concat(authors.au_fname, ' ', authors.au_lname)) as authors
        from titles
        left join titleauthor
        on titles.title_id=titleauthor.title_id
        left join authors
        on authors.au_id=titleauthor.au_id
        group by titles.title
        order by num_titles desc) as t
        group by t.year;

'''

In [22]:
df=pd.read_sql_query(query, motor)

df.head()

                                              titles  year
0  Sushi, Anyone?,Computer Phobic AND Non-Phobic ...  1991
1                          Secrets of Silicon Valley  1994
2   Net Etiquette,The Psychology of Computer Cooking  2014

In [25]:
%time pd.read_sql_query('select * from publications.employee;', motor)['job_id'].sum()

CPU times: user 4.01 ms, sys: 966 µs, total: 4.97 ms
Wall time: 4.81 ms

365

In [27]:
%time pd.read_sql_query('select sum(job_id) as j from publications.employee;', motor)['j'][0]

CPU times: user 1.98 ms, sys: 854 µs, total: 2.83 ms
Wall time: 2.23 ms

365.0

In [28]:
pd.read_sql('show tables;', motor)

   Tables_in_publications
0                 authors
1               discounts
2                employee
3                    jobs
4                pub_info
5              publishers
6                roysched
7                   sales
8                  stores
9             titleauthor
10                 titles

# Postgres

In [29]:
from sqlalchemy import create_engine, Column, Float, Integer, JSON, DateTime, Text
from sqlalchemy.orm import sessionmaker
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import DDL

!sudo -u postgres createdb prueba

In [30]:
#str_conn='postgresql+psycopg2://postgres:password@localhost:5432/prueba'

str_conn='postgresql://postgres:password@localhost:5432/prueba'

In [31]:
class Conector:
    def __init__(self, str_conn):
        print('Conectando...')
        
        self.motor=create_engine(str_conn)
        self.sesion=sessionmaker(bind=self.motor)()

In [35]:
Base=declarative_base()

class Tabla(Base):
    __tablename__='articles'
    __table_args__={'schema': 'prueba'}
    
    _id=Column(Integer(), primary_key=True)
    prime_genre=Column(Text())
    total_rating=Column(Float())
    avg_rating=Column(Float())

In [42]:
class Prueba:
    
    def __init__(self, str_conn):
        
        conn=Conector(str_conn)
        self.motor=conn.motor
        self.sesion=conn.sesion
        
        self.motor.execute(DDL('create schema if not exists prueba'))
        
    
    def crea_tablas(self):
        if not self.motor.dialect.has_table(self.motor, Tabla.__tablename__, schema='prueba'):
            print('Creando tabla...')
            Tabla.__table__.create(self.motor)
        else:
            print('Tabla ya existe.')
        
        
    def rellena_tablas(self, datos):
        
        for e in datos.itertuples():
            
            item=Tabla(_id=e[0],
                       prime_genre=e[1],
                       total_rating=e[2],
                       avg_rating=e[3])
            
            self.sesion.add(item)
            
        self.sesion.commit()
        print('Comiteado')
        
        
    def borra_tabla(self):
        if self.motor.dialect.has_table(self.motor, Tabla.__tablename__, schema='prueba'):
            print('Borrando tabla...')
            Tabla.__table__.drop(self.motor)
            
            
    def show_df(self):
        data=self.motor.execute(DDL('select * from prueba.articles')).fetchall()
        columns=self.motor.execute(DDL("select * from prueba.information_schema.columns where table_name='articles'")).fetchall()
        return pd.DataFrame(data, columns=[e[3] for e in columns])

In [43]:
prueba=Prueba(str_conn)

Conectando...

In [44]:
help(prueba)

Help on Prueba in module __main__ object:

class Prueba(builtins.object)
 |  Prueba(str_conn)
 |
 |  Methods defined here:
 |
 |  __init__(self, str_conn)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  borra_tabla(self)
 |
 |  crea_tablas(self)
 |
 |  rellena_tablas(self, datos)
 |
 |  show_df(self)
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)

In [46]:
prueba.borra_tabla()

In [47]:
prueba.crea_tablas()

Creando tabla...

In [48]:
prueba.borra_tabla()

Borrando tabla...

In [49]:
prueba.crea_tablas()

Creando tabla...

In [50]:
prueba.rellena_tablas(datos)

In [52]:
prueba.show_df()

   _id        prime_genre  total_rating  avg_rating
0    0              Games    42713023.0    3.528578
1    1  Social Networking     7590182.0    2.996503
2    2      Photo & Video     4550732.0    3.793413
3    3              Music     3784296.0    3.940299
4    4      Entertainment     3614869.0    3.148204
5    5           Shopping     2268348.0    3.533058
6    6             Sports     1590189.0    2.917722
7    7          Utilities     1527101.0    3.454128
8    8   Health & Fitness     1516376.0    3.578947
9    9            Weather     1463849.0    3.258065